'''
	n   普通名词
	nt  时间名词
	nd  方位名词
	nl  处所名词
	nh  人名
	nhf 姓
	nhs 名
	ns  地名
	nn  族名
	ni  机构名
	nz  其他专名
	v   动词
	vd  趋向动词
	vl  联系动词
	vu  能愿动词
	a   形容词
	f   区别词
	m   数词　　
	q   量词
	d   副词
	r   代词
	p   介词
	c   连词
	u   助词
	e   叹词
	o   拟声词
	i   习用语
	j   缩略语
	h   前接成分
	k   后接成分
	g   语素字
	x   非语素字
	w   标点符号
	ws  非汉字字符串
	wu  其他未知的符号
'''

pos_list=['n','nt','nd','nl','nh','nhf','nhs','ns','nn','ni','nz','v','vd','vl','vu','a','f','m','q','d','r','p','c','u','e','o','i','j','h','k','g','x','w','ws','wu']
pos_dict={'n': 0, 'nt': 1, 'nd': 2, 'nl': 3, 'nh': 4, 'nhf': 5, 'nhs': 6, 'ns': 7, 'nn': 8, 'ni': 9, 'nz': 10, 'v': 11, 'vd': 12, 'vl': 13, 'vu': 14, 'a': 15, 'f': 16, 'm': 17, 'q': 18, 'd': 19, 'r': 20, 'p': 21, 'c': 22, 'u': 23, 'e': 24, 'o': 25, 'i': 26, 'j': 27, 'h': 28, 'k': 29, 'g': 30, 'x': 31, 'w': 32, 'ws': 33, 'wu': 34}
